'use client';

import { useAuthorizedUser } from '@frontend/shared/services/user-information/authorized-user.hook';

export default function UserMainPage() {
  const user = useAuthorizedUser();

  return (
    <div className="flex flex-col items-center justify-center p-5">
      <p>
        Удар Кагуи Ооцуцуки 7 Пустой Период 7.1 Наруто: Последний Фильм 7.2 Коноха Хиден: Идеальный День для Свадьбы 8
        Новая Эра 8.1 Поступление в Академию 8.2 Сарада Учиха 8.3 Выпускные Экзамены 8.4 Миссии Генинов 8.5 Банда Бьякуя
        8.6 Противостояние Момошики 8.7 Чоучоу 8.8 Исчезновение Мицуки 8.9 Джуго 8.10 Любовь Конохамару 8.11 Перемещение
        во Времени 8.12 Бандиты Муджина 8.13 Появление Кары 8.14 Ao 8.15 Каваки 8.16 Повторный Экзамен на Чуунина 9
        Способности 9.1 Ниндзюцу 9.2 Природные Трансформации 9.3 Букидзюцу 9.4 Чакра и Физическая Сила 10 Появление в
        других СМИ 10.1 OVA 10.1.1 Экзамен на Чуунина в Разгаре! Наруто Против Конохамару! 10.2 Видеоигры 11 Создание и
        концепция 12 Прочее 13 Цитаты 14 Примечания 15 Навигация Внешность Конохамару в первой части. Конохамару в
        первой части. 1/5 Конохамару представлен как молодой Шиноби. У него короткие каштановые волосы и голубые глаза.
        В некоторых моментах в аниме, Конохамару изображен с маленьким румянцем на щеках.[7] Одежда Конохамару в первой
        части представляет из себя жёлтую футболку с инициалом Конохи, длинные серые шорты и синие сандалии. К шее у
        него привязан синий плащ, имеющий длину до самых ног. Кроме того, на голове он носит необычную серую шапку.
        После встречи с Наруто он начинает носить его зелёные очки. У Конохомару не было переднего зуба. Во второй части
        он отличительно вырос. На его лбу появился налобный протектор, волосы стоят в другую сторону. Одет в куртку
        цвета хаки; серые штаны, на правой ноге бинт и сумка для хранения оружия; те же синие сандалии. Синий шарф так и
        остался, но уже не волочится за ним. Спустя несколько лет черты лица Конохамару увеличиваются. Его волосы сильно
        отрастают, а на голове он начинает носить протектор Конохи. Внешний вид Конохамару также терпит изменения: он
        носит тот же плащ, на ногах он носит коричневые штаны и синие сандалии. К штанам прикреплен бинт на правой ноге
        вместе с сумкой с метательным оружием. Верхняя одежда представлена в виде зелёной куртки с коричневой обшивкой.
        Во время Фестиваля Ринне, волосы Конохамару пострижены до короткой длины, однако его лицо округляет две длинные
        пряди. Его наряд состоит из черно-серой куртки на молнии, темно-серые брюки, новые сандалии шиноби Конохи,
        вокруг рук носит бинты таким же образом, как Рок Ли. Теперь он не носит шарф, который обычно носил. На свадьбе
        Наруто и Хинаты Хьюги он одет в официальный костюм. Спустя несколько лет, достигнув совершеннолетия, он
        становится высоким молодым человеком с чуть более узким лицом, его прическа в виде ёжика, он носит бронежилет с
        красной повязкой на левой руке, на которой изображена эмблема его клана, а также тёмно-синие штаны, чёрные
        сандалии и короткий голубой шарф на шее. Личность Регистрационное фото ниндзя Конохамару. Регистрационное фото
        ниндзя Конохамару. Хотя он представлен на полпути неудавшейся попыткой победить своего дедушку, Конохамару
        вначале находит определенное наслаждение в своем статусе внука Хокаге: его часто жалеют за то, что он наказан за
        свои действия, и будет подталкивать людей, которые не желают наказывать его. Когда Наруто не проявляет
        сдержанности к нему и свободно бьет его, Конохамару впечатляется им и объявляет Наруто как его соперником, так и
        образцом для подражания, по-разному называя его «боссом» (オヤブン, oyabun) и « старшим братом» (兄ちゃん,
        Nīchan). Как и Наруто, Конохамару имеет тенденцию быть громким, упрямым, проводит чрезмерное количество времени,
        изобретая извращенную ниндзюцу, и в аниме даже подражает фотографии регистрации Кабуки ниндзя Наруто, когда он
        берет свое. Он также заканчивает многие из своих предложений «коре» (コレ; Буквально означает: «эй», «о», «йо»),
        как Наруто делает с «даттебаё». Конохамару также берет на себя ряд хороших качеств от Наруто, таких как
        осознание того, что становление Хокаге — долгий процесс, для которого нет быстрого пути. Это фиксирует
        Конохамару в его учебе в Академии и значительно облегчает работу его наставника, Эбису. В своем стремлении
        подняться на уровень Наруто, Конохамару овладевает множеством техник, и принимает отказ бежать от боя, даже
        против превосходящих противников. В аниме Конохамару в конце концов продвигается мимо своего соревнования с
        Наруто за мантию Хокаге, вместо этого решая, что он станет Хокаге только после того, как Наруто станет им.
        Спустя годы Конохамару становится эмоциональным в том, что он может наставлять сына Наруто, Боруто Узумаки, так
        же, как Наруто наставлял его. В то время как большая часть почитания Конохамару для Наруто заслуживает заслуги,
        некоторые из похвал Конохамару за него больше связаны с его собственной легковерием и плотностью: когда он
        выезжает во время своей первой встречи, он предполагает, что Наруто что-то сделал, не желая обвинять свою
        неуклюжесть; Конохамару плохо использует Технику плаща-невидимки постоянно обнаруживается Наруто. Наруто
        поощряет эту похвалу до степени, никогда не отказываясь от комплиментов и никогда не исправляя восприятие
        Конохамару о нем как о даме.
      </p>
    </div>
  );
}
